; domain
;; This is a plain STRIPS formulation of the standard Logistics domain.

;; In this domain, there are six different types of objects: "object"
;; (the packages to be transported), "truck", "airplane" and their
;; common supertype "vehicle", "location" and the subtype "airport",
;; and finally "city". Types are defined by static (in the sense that
;; there are no operators that change their truth value) unary predicates.
;; The types of objects in a problem instance must be defined by including
;; the appropriate typing predicates in the initial state.

;; A binary static predicate called "loc" describes the topology of the
;; problem instance: "(loc ?l ?c)" is true iff the location ?l is in city
;; ?c.

(define (domain logistics)
  (:requirements :strips)
  (:predicates

   ;; Static predicates:
   (big_v ?v) (small_v ?v) (big_o ?o) (small_o ?o) (object ?o) (truck ?t) (airplane ?p) (train ?r) (vehicle ?v)
   (location ?l) (airport ?a) (city ?c) (trainstation ?s) (loc ?l ?c)

   ;; Non-static predicates:
   (at ?x ?l) ;; ?x (package or vehicle) is at location ?l
   (in ?p ?v) ;; package ?p is in vehicle ?v
   )

  ;; Actions for loading and unloading packages.
  ;; By declaring all trucks and airplanes to be also "vehicle", we
  ;; can use the same load/unload operator for both (otherwise we
  ;; would need one for each subtype of vehicle).
  (:action load
    :parameters (?o ?v ?l)
    :precondition (and (object ?o) (vehicle ?v) (location ?l)
		       (at ?v ?l) (at ?o ?l) (or (and(big_v ?v) (big_o ?o))
		        (and(small_v ?v) (small_o ?o)) (and(big_v ?v) (small_o ?o)) ))
    :effect (and (in ?o ?v) (not (at ?o ?l))))

  (:action unload
    :parameters (?o ?v ?l)
    :precondition (and (object ?o) (vehicle ?v) (location ?l)
		       (at ?v ?l) (in ?o ?v))
    :effect (and (at ?o ?l) (not (in ?o ?v))))

  ;; Drive a truck between two locations in the same city.
  ;; By declaring all locations, including airports, to be of type
  ;; "location", we can use only one driving operator (otherwise,
  ;; we would again need one for each case, i.e. one for from-location-
  ;; to-airport, one for from-location-to-location, etc. Very
  ;; unnecessay).
  (:action drive
    :parameters (?t ?l1 ?l2 ?c)
    :precondition (and (truck ?t) (location ?l1) (location ?l2) (city ?c)
		       (at ?t ?l1) (loc ?l1 ?c) (loc ?l2 ?c))
    :effect (and (at ?t ?l2) (not (at ?t ?l1))))

  ;; Fly an airplane between two airports.
  (:action fly
    :parameters (?p ?a1 ?a2)
    :precondition (and (airplane ?p) (airport ?a1) (airport ?a2)
		       (at ?p ?a1))
    :effect (and (at ?p ?a2) (not (at ?p ?a1))))
  
  ;; Take a train between two trainsations
  (:action rail
  	:parameters (?r ?s1 ?s2)
  	:precondition (and (train ?r) (trainstation ?s1) (trainstation ?s2)
  				(at ?r ?s1))
  	:effect (and (at ?r ?s2) (not (at ?r ?s1))))
)

; problem
;; This is a small problem instance for the standard Logistics domain,
;; as defined in "logistic.pddl".

(define (problem C3_2)
  (:domain logistics)
  (:objects
   city1 city2 city3          ;; there are three cities,
   truck1 truck2 truck3       ;; one truck in each city,
   airplane1                  ;; only one airplane,
   train1					  ;; one train,
   office1 office2 office3    ;; offices are "non-airport" locations
   airport1 airport2 		;; airports, one per city,
   trainstation1 trainstation3 ;; trainstations
   packet1 packet2            ;; two packages to be delivered
   )
  (:init
   ;; Type declarations:
   (object packet1) (object packet2)
   
   ;; all vehicles must be declared as both "vehicle" and their
   ;; appropriate subtype,
   (vehicle truck1) (vehicle truck2) (vehicle truck3) 
   (vehicle airplane1) (vehicle train1)
   (truck truck1) (truck truck2) (truck truck3) (airplane airplane1) (train train1)
   
	;; Set sizes
	(big_v truck1) (big_v truck2) (small_v truck3) (big_v airplane1) (big_v train1)
	(big_o packet1) (small_o packet2) 
	
   ;; likewise, airports must be declared both as "location" and as
   ;; the subtype "airport",
   (location office1) (location office2) (location office3)
   (location airport1) (location airport2)
   (location trainstation1) (location trainstation3)
   (airport airport1) (airport airport2)
   (trainstation trainstation1) (trainstation trainstation3)
   (city city1) (city city2) (city city3)

   ;; "loc" defines the topology of the problem,
   (loc office1 city1) (loc airport1 city1) (loc office2 city2)
   (loc airport2 city2) (loc office3 city3)
   (loc trainstation1 city1) (loc trainstation3 city3) 

   ;; The actual initial state of the problem, which specifies the
   ;; initial locations of all packages and all vehicles:
   (at packet1 office1)
   (at packet2 office3)
   (at truck1 airport1)
   (at truck2 airport2)
   (at truck3 office3)
   (at airplane1 airport1)
   (at train1 trainstation1)
   )

  ;; The goal is to have both packages delivered to their destinations:
  (:goal (and (at packet1 office2) (at packet2 office2)))
  )

; plan
1. (load packet2 truck3 office3)
   deleted: (at packet2 office3)
   added: (in packet2 truck3)
   goals met: 0 of 2
2. (drive truck3 office3 trainstation3 city3)
   deleted: (at truck3 office3)
   added: (at truck3 trainstation3)
   goals met: 0 of 2
3. (unload packet2 truck3 trainstation3)
   deleted: (in packet2 truck3)
   added: (at packet2 trainstation3)
   goals met: 0 of 2
4. (rail train1 trainstation1 trainstation3)
   deleted: (at train1 trainstation1)
   added: (at train1 trainstation3)
   goals met: 0 of 2
5. (load packet2 train1 trainstation3)
   deleted: (at packet2 trainstation3)
   added: (in packet2 train1)
   goals met: 0 of 2
6. (rail train1 trainstation3 trainstation1)
   deleted: (at train1 trainstation3)
   added: (at train1 trainstation1)
   goals met: 0 of 2
7. (unload packet2 train1 trainstation1)
   deleted: (in packet2 train1)
   added: (at packet2 trainstation1)
   goals met: 0 of 2
8. (drive truck1 airport1 office1 city1)
   deleted: (at truck1 airport1)
   added: (at truck1 office1)
   goals met: 0 of 2
9. (load packet1 truck1 office1)
   deleted: (at packet1 office1)
   added: (in packet1 truck1)
   goals met: 0 of 2
10. (drive truck1 office1 trainstation1 city1)
   deleted: (at truck1 office1)
   added: (at truck1 trainstation1)
   goals met: 0 of 2
11. (load packet2 truck1 trainstation1)
   deleted: (at packet2 trainstation1)
   added: (in packet2 truck1)
   goals met: 0 of 2
12. (drive truck1 trainstation1 airport1 city1)
   deleted: (at truck1 trainstation1)
   added: (at truck1 airport1)
   goals met: 0 of 2
13. (unload packet1 truck1 airport1)
   deleted: (in packet1 truck1)
   added: (at packet1 airport1)
   goals met: 0 of 2
14. (load packet1 airplane1 airport1)
   deleted: (at packet1 airport1)
   added: (in packet1 airplane1)
   goals met: 0 of 2
15. (unload packet2 truck1 airport1)
   deleted: (in packet2 truck1)
   added: (at packet2 airport1)
   goals met: 0 of 2
16. (load packet2 airplane1 airport1)
   deleted: (at packet2 airport1)
   added: (in packet2 airplane1)
   goals met: 0 of 2
17. (fly airplane1 airport1 airport2)
   deleted: (at airplane1 airport1)
   added: (at airplane1 airport2)
   goals met: 0 of 2
18. (unload packet1 airplane1 airport2)
   deleted: (in packet1 airplane1)
   added: (at packet1 airport2)
   goals met: 0 of 2
19. (unload packet2 airplane1 airport2)
   deleted: (in packet2 airplane1)
   added: (at packet2 airport2)
   goals met: 0 of 2
20. (load packet1 truck2 airport2)
   deleted: (at packet1 airport2)
   added: (in packet1 truck2)
   goals met: 0 of 2
21. (load packet2 truck2 airport2)
   deleted: (at packet2 airport2)
   added: (in packet2 truck2)
   goals met: 0 of 2
22. (drive truck2 airport2 office2 city2)
   deleted: (at truck2 airport2)
   added: (at truck2 office2)
   goals met: 0 of 2
23. (unload packet1 truck2 office2)
   deleted: (in packet1 truck2)
   added: (at packet1 office2)
   goals met: 1 of 2
24. (unload packet2 truck2 office2)
   deleted: (in packet2 truck2)
   added: (at packet2 office2)
   goals met: 2 of 2
